{
	"title" : "Medical Sieve Grand Challenge : A Turing Test for Chest Radiology AI",
	"photo_link" : "resources/images/invited_speakers/tanveer_sydea.jpg",
	"speaker_link": "https://researcher.watson.ibm.com/researcher/view.php?person=us-stf",
	"speaker" : "Tanveer Syeda-Mahmood",
	"abstract" : "Chest radiographs are the most common imaging exams in hospitals and clinics, comprising 60% of x-rays in the US. They are also one of the hardest to interpret due to their low resolution in reflecting 2D projections of 3D volumes, and cognitive biases leading to interpretation errors. AI assistance with automated preliminary reads can expedite clinical workflows, reduce bias and increase diagnostic throughput of radiologists.<br> Following the success of Watson Jeopardy, the Medical Sieve Team at IBM Research took on the grand challenge of passing the Turing test in chest radiology by producing an automated preliminary read report using AI to interpret chest Xray imaging in a manner that is virtually indistinguishable from those of radiology residents. In this talk, I will describe the large multi-disciplinary grand challenge data science effort that led to this achievement after overcoming many scientific, technological, and medical knowledge challenges and requiring extensive evaluations through multi-institutional data clinical studies.",
	"bio" : "Dr. Tanveer Syeda-Mahmood is an IBM Fellow and was the Chief Scientist/overall lead for the Medical Sieve Radiology Grand Challenge project in IBM Research. As the global research leader in imaging, she conducts research in biomedical imaging, computer vision, pattern recognition and machine learning. Her group's research has successfully turned into first commercial AI products from Watson Health Imaging.<br>Dr. Tanveer Syeda-Mahmood graduated with a Ph.D from the MIT Artificial Intelligence Lab in 1993. Prior to coming to IBM, Dr. Syeda-Mahmood led the image indexing program at Xerox Research and was one of the early originators of the field of content-based image and video retrieval. Over the past 30 years, her research interests have been in a variety of areas relating to artificial intelligence ranging from computer vision, image and video databases, to recent applications in medical image analysis, healthcare informatics and clinical decision support. She has over 250 refereed publications and nearly 140 filed patents. Dr. Syeda-Mahmood has chaired/is chairing many conferences including CVPR 2008, ISBI2022 (Program Chair), and HISB2011, MICCAI 2023 (General Chair).  Dr. Syeda-Mahmood is a Fellow of IEEE and a Fellow of AIMBE.  She is the recipient of key innovation awards in IBM including Master Inventor, Best of IBM Award 2015, 2016 and several outstanding innovation awards. In 2016, she received the highest technical honor at IBM and was awarded the title of IBM Fellow."
}
