{
	"title" : "Efficient Circuits and Systems for Cryptography and Hardware Security",
	"photo_link" : "resources/images/faculty_speakers/utsav_ese.png",
	"speaker_link": "https://banerjeeutsav.github.io/",
	"speaker" : "Utsav Banerjee",
	"abstract" : "Hardware security has emerged as a growing concern with the advent of the Internet of Things (IoT) which consists of large networks of wireless-connected embedded devices. Although the growth of IoT has enabled novel applications, they have also become attractive targets for cyber attackers. Securing these resource-constrained embedded systems involves circuits, algorithms and architectures with low computation and storage overheads as well as countermeasures against physical attacks. One such approach is the design of efficient cryptographic hardware accelerators for IoT applications. This talk will provide an overview of design considerations and custom hardware architectures for modern public key cryptography based on lattices and elliptic curves. ASIC implementation results will be presented, along with examples of software-hardware co-design, system-level integration and demonstration of end-to-end protocols such as transport layer security. This talk will summarize key results and emerging directions of research in the implementation aspects of cryptography and hardware security.",
	"bio" : "Utsav Banerjee received the B.Tech. degree in electronics and electrical communication engineering from the Indian Institute of Technology (IIT) Kharagpur in 2013, and the S.M. and Ph.D. degrees in electrical engineering and computer science from the Massachusetts Institute of Technology (MIT) in 2017 and 2021 respectively. From 2013 to 2015, he was with the low-power system-on-chip design team at Qualcomm, where he was involved in the design and verification of power management architectures for mobile chipsets. Since October 2021, he has been with the Indian Institute of Science (IISc) Bangalore, where he is currently an Assistant Professor in the Department of Electronic Systems Engineering. His research interests include cryptography, hardware security, digital circuits and embedded systems. He was a recipient of the President of India Gold Medal from IIT Kharagpur in 2013, the Irwin and Joan Jacobs Presidential Fellowship from MIT in 2015, and the Qualcomm Innovation Fellowship in 2016."
}
