{
	"title" : "Cluster Structure Assessment and Change Detection in Streaming Data",
	"photo_link" : "resources/images/faculty_speakers/punit_rbccps.jpeg",
	"speaker_link": "https://www.punitrathore.com/",
	"speaker" : "Punit Rathore",
	"abstract" : "Everyday, an abundant amount of data is generated from various sources such as Internet of Things (IoT) networks, smartphones, and social network activities. Making sense of such an unprecedented amount of data is essential for many businesses, services and almost every smart city domain such as healthcare, transportation, environment, and energy sectors. The data generated from these domains are mostly unlabeled, anomalous, and streaming, which makes their interpretation challenging to create useful knowledge. Cluster analysis is a useful unsupervised approach to discover the underlying groups and useful patterns in the data. One important problem in cluster analysis is the cluster tendency assessment which asks the question whether data have clusters? If yes, how many?  In this talk, Dr. Punit Rathore will present his novel cluster assessment algorithm for time-efficient tracking of cluster structures and change detection in data streams.",
	"bio" : "Dr. Punit Rathore is currently an Assistant Professor at Indian Institute of Science, Bangalore in Robert Bosch Centre for Cyberphysical Systems, jointly with Centre for infrastructure, Sustainable Transportation, and Urban Planning. Before joining IISc, Dr. Rathore worked as a Postdoctoral Fellow in Senseable City Lab at Massachusetts Institute of Technology (MIT), Cambridge, USA and in Grab-NUS AI Lab at National University of Singapore. Dr Rathore completed his Ph.D. from the Department of Electrical and Electronics Engineering, University of Melbourne, Australia in Jan-2019. Prior to PhD,  Dr. Punit worked as a Researcher in Automation Division at Tata Steel Limited, Jamshedpur, where he developed several real-time systems based on machine learning and machine vision for manufacturing industries. His research work has been internationally recognized with multiple best-paper  awards at world-recognized IEEE conferences and best thesis prizes by IEEE System, Man, and Cybernetics Society (SMC) and Melbourne School of Engineering, the University of Melbourne. His current research interests are in unsupervised learning,  streaming data analytics, explainable ML,  and data-driven techniques for IoT, transportation and autonomous systems."
}
