{
	"title" : "Round-Optimal Black-Box Protocol Compilers",
	"photo_link" : "resources/images/invited_speakers/akshayaram_srinivasan.jpeg",
	"speaker_link": "https://www.tifr.res.in/~akshayaram.srinivasan/",
	"speaker" : "Akshayaram Srinivasan",
	"abstract" : "Secure Multiparty Computation (MPC) is a foundational cryptographic primitive with numerous applications. There are two popular adversarial models that have been considered in the literature for analyzing the security of MPC protocols. The first is called semi-honest security and this protects only against a weaker form of adversary where the corrupted parties are forced to follow the protocol. The more stronger malicious adversarial model allows the corrupted parties to deviate arbitrarily from the protocol specification. Typically, semi-honest protocols are easy to construct and analyze whereas constructing malicious protocols involve sophisticated tools and techniques. Our focus is on constructing compilers that upgrade the security of protocols from semi-honest to malicious with little overhead. The prior general purpose compilers for upgrading security either make non-black-box use of the underlying cryptographic primitives and thereby, incur a huge computational blow-up or the black-box versions have a large overhead in the round complexity. In this talk, I will describe a round-preserving black-box compiler for upgrading the security of round-optimal semi-honest protocols. The compiler can be instantiated either in the random oracle model or in the 1-out-of-2 OT correlations model. As a result of this compiler, we get the first constructions of two-round malicious-secure OT, two-round NISC protocol, round-optimal 2PC and MPC that make black-box use of a two-round semi-honest OT in the random oracle model. ",
	"bio" : "Akshayaram Srinivasan is a Reader in the School of Technology and Computer Science at Tata Institute of Fundamental Research, Mumbai. His research interests are broadly in the area of Cryptography, with a focus on its theoretical foundations. Before joining TIFR, he obtained his Ph.D. in Computer Science from University of California, Berkeley and his B.Tech in Computer Science and Engineering from Indian Institute of Technology, Madras. His research has been recognized with a best paper award at Eurocrypt 2018 and with an invitation to the Journal of Cryptology for a paper in Crypto 2019. "
}
