{
	"title" : "Algorithmic Balancing of Consumer & Creator Goals in Multi-stakeholder Recommendations",
	"photo_link" : "resources/images/invited_speakers/rishabh.jpg",
	"speaker_link": "http://rishabhmehrotra.com/",
	"speaker" : "Rishabh Mehrotra",
	"abstract" : "Recommender systems shape the bulk of consumption on digital platforms, and are increasingly expected to not only support consumer needs but also benefit content creators and suppliers by helping them get exposed to consumers and grow their audience. Indeed, most modern digital platforms are multi-stakeholder platforms (e.g. AirBnb: guests and hosts, Youtube: consumers and producers, Uber: riders and drivers, Amazon: buyers and sellers), and rely on recommender systems to strive for a healthy balance between user, creators and platform objectives to ensure long-term health and sustainability of the platform. In this talk, we discuss a few recent advancements in multi-objective modeling spanning fuzzy aggregations, set transformers and reinforcement learning. While the main focus is on multi-objective balancing, the talk also touches upon related problems of trade-off handling, and user/content/creator understanding to support multi-stakeholder platform ecosystems. The talk ends by discussing learnings from the development and deployment of balancing approaches across 400+ million users on large scale recommendation platforms.",
	"bio" : "Rishabh Mehrotra currently works as a Director of Machine Learning at ShareChat based in London. His current research focuses on machine learning for marketplaces, multi-objective modeling of recommenders and creator ecosystem. Prior to ShareChat, he was an Area Tech Lead and Staff Scientist/Engineer at Spotify where he led multiple ML projects from basic research to production across 400+ million users. Rishabh has a PhD in Machine Learning from UCL, and 50+ research papers and patents. Some of his recent work has been published at conferences including KDD, WWW, SIGIR, RecSys and WSDM. He has co-taught a number of tutorials and summer school courses on the topics of learning from user interactions, marketplaces, and personalization."
}
