{
	"title" : "Exploiting Structure in the Target (Output) Space for Improved Reasoning and Explainability in Neural Models",
	"photo_link" : "resources/images/invited_speakers/parag.jpg",
	"speaker_link": "https://www.cse.iitd.ac.in/~parags/",
	"speaker" : "Prof. Parag Singla",
	"abstract" : "Last decade has seen phenomenal growth in application of neural models to a variety of problems, including those in Computer Vision, NLP and Speech, among other domains. One of the recent research directions has been around the problem of incorporating symbolic reasoning in neural networks, to enable them to do more effective reasoning as well as help them be explainable/interpretable. In this talk, we will present two different problems (and corresponding solutions) in this regard which exploit problem structure in the target space. The first one deals with solution multiplicity in Structured CSPs - we present 1oML, which defines the novel problem of finding one of many solutions for problems expressed as Structured CSPs, such as solving a partially filled Sudoku board. Our solution approach is based on a novel RL formulation, which allows us to choose the right 'y' (target) for a given 'x' (input)  while learning the model. Second, we present the problem of explainability in Common-sense Question Answering (CQA). We propose a new dataset (called ECQA), which expresses explanations as a set of positive (negative) properties of the (in)correct answers. We present a neural property ranker/selection module for property retrieval, as well as a GPT-2 based architecture for property generation, given the question and (in)correct answer choice. We conclude with broader research frontiers in the space of neuro-symbolic reasoning.",
	"bio" : "Parag Singla is an Associate Professor in the Department of CSE @ IIT Delhi. He received his Bachelors from IIT Bombay, and Masters and PhD from University of Washington, Seattle. He spent a little more than a year as a postdoc at University of Texas at Austin, before starting as a faculty member at IIT Delhi in the end of 2011. His research expertise includes Statistical Relational Learning, Machine Learning, and Artificial Intelligence. His recent focus has been in the area of neuro-symbolic reasoning, which aims to combine the power of symbolic reasoning with neural models. He has authored more than 40 papers in top-tier machine learning conferences and journals, including NeurIPS, AAAI, IJCAI, UAI, ACL, NAACL, CVPR, ICAPS and WWW. He has been a recipient of Visvesvaraya young faculty fellowship from Govt. of India (2016- 2021), and has a best paper award to his name."
}
