{
	"title" : "An overview of asynchronous computing method for scalable PDE solvers",
	"photo_link" : "resources/images/faculty_speakers/konduriadi_cds.jpg",
	"speaker_link": "http://cds.iisc.ac.in/faculty/konduriadi/",
	"speaker" : "Konduri Aditya",
	"abstract" : "Numerical simulations of physical phenomena and engineering systems, governed by non-linear partial differential equations, demand massive computations with extreme levels of parallelism. Current state-of-the-art simulations are routinely performed on hundreds of thousands of processing elements (PEs). At an extreme scale, it is observed that data movement and its synchronization pose a bottleneck in the scalability of solvers. Recently, an asynchronous computing method that relaxes communication synchronization at a mathematical level has shown significant promise in improving the scalability of PDE solvers. In this method, communication synchronization between PEs due to halo exchanges is relaxed, and computations proceed regardless of communication status. It was shown that numerical accuracy of standard schemes like the finite-differences, implemented with relaxed communication synchronization, is significantly affected. Subsequently, new asynchronytolerant schemes were developed to compute accurate solutions and show good scalability. In this talk, an overview of the status of the asynchronous computing method for PDE solvers and its applicability towards exascale simulations will be presented. The relaxation of data synchronization at a mathematical level can further leverage asynchronous parallel communication and runtime models. The coupling of asynchrony-tolerant schemes with such models will be discussed.",
	"bio" : "I work as an Assistant Professor in the Department of Computational and Data Sciences, Indian Institute of Science, Bengaluru, India. Prior to this, I was a Postdoctoral Researcher at the Combustion Research Facility, Sandia National Laboratories, Livermore, CA, United States. My current research includes large scale simulations of turbulent combustion relevant to gas turbine and scramjet engines, design of machine learning methods for anomalous/extreme event detection in scientific phenomena, and development of scalable asynchronous numerical methods and simulation algorithms for solving partial differential equations on massively parallel computing systems."
}
